package Set

import "sync"

type set struct {
	mx   sync.RWMutex
	data []int
}

<<<<<<< HEAD
//Получить значения элементов Множества
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
//Получить значения элементов Множества
=======
=======
//Получить значения элементов Множества
=======
<<<<<<< HEAD
<<<<<<< HEAD
//Получить значения элементов Множества
=======
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Получить значения элементов Множества
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func (s *set) GetValues() []int {
	return s.data
}

<<<<<<< HEAD
//Создать Множество с задаными значениями numbers (лишние значения отсеются)
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
//Создать Множество с задаными значениями numbers (лишние значения отсеются)
=======
<<<<<<< HEAD
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
<<<<<<< HEAD
//Создать Множество с задаными значениями numbers (лишние значения отсеются)
=======
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Создать Множество с задаными значениями numbers (лишние значения отсеются)
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func CreateSet(numbers ...int) *set {
	var newS set

	for _, item := range numbers {
		newS.Add(item)
	}

	return &newS
}

<<<<<<< HEAD
//Приватный метод поиска элемента elem в Множестве
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
//Приватный метод поиска элемента elem в Множестве
=======
=======
//Приватный метод поиска элемента elem в Множестве
=======
<<<<<<< HEAD
<<<<<<< HEAD
//Приватный метод поиска элемента elem в Множестве
=======
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Приватный метод поиска элемента elem в Множестве
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func (s *set) find(elem int) (int, bool) {
	for i, item := range s.data {
		if item == elem {
			return i, true
		}
	}
	return 0, false
}

<<<<<<< HEAD
//Добавить элемент elem в Множество
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
//Добавить элемент elem в Множество
=======
<<<<<<< HEAD
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
<<<<<<< HEAD
//Добавить элемент elem в Множество
=======
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Добавить элемент elem в Множество
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func (s *set) Add(elem int) {
	_, ok := s.find(elem)
	if !ok {
		s.mx.RLock()
		s.data = append(s.data, elem)
		s.mx.RUnlock()
	}
}

<<<<<<< HEAD
//Удалить элемент elem из Множества
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
//Удалить элемент elem из Множества
=======
=======
//Удалить элемент elem из Множества
=======
<<<<<<< HEAD
<<<<<<< HEAD
//Удалить элемент elem из Множества
=======
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Удалить элемент elem из Множества
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func (s *set) Remove(elem int) bool {
	i, ok := s.find(elem)
	if ok {
		s.mx.RLock()
		s.data = append(s.data[:i], s.data[i+1:]...)
		s.mx.RUnlock()
		return true
	}
	return false
}

<<<<<<< HEAD
//Объединение Множеств s1 и s2.
//Возвращает новое Множество
=======
<<<<<<< HEAD
<<<<<<< HEAD
<<<<<<< HEAD
//Объединение Множеств s1 и s2.
//Возвращает новое Множество
=======
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Объединение Множеств s1 и s2.
//Возвращает новое Множество
>>>>>>> 47c004a... Исправление названия файла-теста.
=======
//Объединение Множеств s1 и s2.
//Возвращает новое Множество
=======
<<<<<<< HEAD
<<<<<<< HEAD
//Объединение Множеств s1 и s2.
//Возвращает новое Множество
=======
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Объединение Множеств s1 и s2.
//Возвращает новое Множество
>>>>>>> 47c004a... Исправление названия файла-теста.
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func Union(s1 *set, s2 *set) *set {
	var newS set

	for _, item := range s1.data {
		newS.Add(item)
	}
	for _, item := range s2.data {
		newS.Add(item)
	}

	return &newS
}

<<<<<<< HEAD
//Разность Множеств s1 и s2.
//Возвращает Множество, состоящее из элементов Множества s1,
//которых нет в Множестве s2
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
//Разность Множеств s1 и s2.
//Возвращает Множество, состоящее из элементов Множества s1,
//которых нет в Множестве s2
=======
<<<<<<< HEAD
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
<<<<<<< HEAD
//Разность Множеств s1 и s2.
//Возвращает Множество, состоящее из элементов Множества s1,
//которых нет в Множестве s2
=======
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Разность Множеств s1 и s2.
//Возвращает Множество, состоящее из элементов Множества s1,
//которых нет в Множестве s2
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func Difference(s1 *set, s2 *set) *set {
	var newS set

	for _, item := range s1.data {
		_, ok := s2.find(item)
		if !ok {
			newS.Add(item)
		}
	}

	return &newS
}

<<<<<<< HEAD
//Пересечение Множеств s1 и s2.
//Возвращает Множество, состоящее из общих элементов
//Множеств s1 и s2
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
//Пересечение Множеств s1 и s2.
//Возвращает Множество, состоящее из общих элементов
//Множеств s1 и s2
=======
<<<<<<< HEAD
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
<<<<<<< HEAD
//Пересечение Множеств s1 и s2.
//Возвращает Множество, состоящее из общих элементов
//Множеств s1 и s2
=======
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Пересечение Множеств s1 и s2.
//Возвращает Множество, состоящее из общих элементов
//Множеств s1 и s2
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func Intersection(s1 *set, s2 *set) *set {
	var newS set

	for _, item := range s1.data {
		_, ok := s2.find(item)
		if ok {
			newS.Add(item)
		}
	}
	return &newS
}

<<<<<<< HEAD
//Проверка на то, что Множество s1 является подмножеством
//множества s2.
//Возвращает bool
=======
<<<<<<< HEAD
<<<<<<< HEAD
=======
//Проверка на то, что Множество s1 является подмножеством
//множества s2.
//Возвращает bool
=======
<<<<<<< HEAD
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
<<<<<<< HEAD
//Проверка на то, что Множество s1 является подмножеством
//множества s2.
//Возвращает bool
=======
>>>>>>> 4b59edf... Реализация множества и тестов к нему
=======
//Проверка на то, что Множество s1 является подмножеством
//множества s2.
//Возвращает bool
>>>>>>> 47c004a... Исправление названия файла-теста.
<<<<<<< HEAD
=======
>>>>>>> parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> a3daf9b... parent 87360e2558227203918361c46afa63e478ed8cf8
>>>>>>> Добавление задачи первого дня и реализации Множеств с тестами
func Subset(s1 *set, s2 *set) bool {
	for _, item := range s1.data {
		_, ok := s2.find(item)
		if !ok {
			return false
		}
	}
	return true
}
